<template>
	<van-popup class="dialog" v-model="value">
		<div @click="closeBox" class="close"></div>
		<span class="dialog-title">KOOBANK克班克典当借款协议</span>
		<div class="closeBtn" @click="closeBox">
			<i class="el-icon-close"></i>
		</div>
		<div>
			<p>
				协议编号：
				<br> 本贷款协议(“本协议”)由下列双方于【 】年【 】月【】日 签署:
				<br> 甲方（贷款人、共同贷款人）
				<br> 证件号码：
				<br> 注册邮箱地址：
				<br> 乙方（出借人）：
				<br> 企业代码：
				<br> 鉴于：
				<br> 甲方有贷款需求，乙方为在新加坡注册的合法经营机构，乙方同意向甲方出贷款项并通过乙方自主运营的KOOBANK克班克平台向甲方提供资金出借及还款管理相关服务，甲乙双方经过平等协商就贷款及相关事宜达成如下协议：
				<br> 第一部分 名词定义
				<br> 除非上下文另有解释，本协议及相关协议中下列用语具有以下含义：
				<br> 1.1本协议：指本《借款协议》第一部分、第二部分及所有附件中的任何条款、内容和信息。
				<br> 1.2甲方：即本协议贷款人，贷款人应为符合法律规定的具有完全民事权利能力和民事行为能力，且能独立承担本协议项下权利义务的自然人。
				<br> 1.3乙方：即本协议出借人，KOOBANK克班克平台运营方，是为贷款人提供贷款及相关服务，并接受甲方数字资产TOKEN质押担保的质押权人。
				<br> 1.4第三方机构：本协议指接受乙方委托为甲方个人信息、信用信息提供查询、验证服务的乙方合作机构，为数字资产币市场公允认可的相关自有系统或外部服务。
				<br> 1.5平台：是指乙方自主运营的提供贷款服务及区块链平台（网址：https://www.koobank.com，下称“乙方平台”或“平台”）。
				<br> 1.6日：指相关法律规定的自然日。
				<br> 1.7还款：指甲方按照本协议约定向乙方偿还的本息。
				<br> 1.8提前还款：即贷款期限届满前，贷款人按照本协议相关约定一次性提前向出借人进行还款的情形；
				<br> 1.9现金钱包：指本协议项下出借人向贷款人发放贷款本金的账户，即甲方贷款本金的收款账户。甲方可用于提现、还款充值、支付矿工费及其他相关费用的专用账户。
				<br> 1.10抵押物钱包：指本协议项下用于贷款质押数字TOKEN的充值账户。
				<br> 1.11价格牌：区块链技术支持下经公认的方式对不同种类数字TOKEN进行实时监测获得的价格表，是对不同时间、场景下各类数字币的市场浮动价格的公允、实时的固定形态。
				<br> 1.12 CTL：出借方用以评估借款人负债比的风控标准。
				<br> 1.13本协议项下出借人、贷款人分别称“甲方”、“乙方”合称“各方”。
				<br> 本协议相关具体条款
				<br> 第一条  甲方向乙方贷款，贷款信息如下：
				<br> • 借款本金数额:
				<br> • 借款月利率：
				<br> • 借款期限：日（自年月日起至年月日止）
				<br> • 起息日：年 月日
				<br> • 综合服务费：
				<br> • 24小时赎回保险费：
				<br> 第二条  贷款本金的支付及还款
				<br> 2.1贷款本金的支付
				<br> 2.1.1甲方确认，在本协议项下贷款的专用收款账户：
				<br> 户名：
				<br> 地址：
				<br> 2.1.2 甲方对本协议第一条所述借款相关信息全部认可，自主自愿依据本协议第一条规定的内容，向乙方借款，并授权乙方通过乙方确认的任何方式将本协议第一条约定的借款本金金额划入到甲方指定的钱包中。
				<br> 2.1.3乙方在采取上述方式支付贷款本金后，即视为甲方已按约收到本协议第一条约定金额的贷款本金及乙方已按约履行了付款义务，因钱包账户问题致甲方收款失败的与乙方无关，应由甲方自行解决，因此给乙方造成损失的，甲方应承担赔偿责任。
				<br> 2.2还款
				<br> 2.2.1 甲方知晓并同意，乙方划入甲方的借款为扣除本协议第一条约定的，综合服务费、利息、24小时赎回保险费之后的费用。甲方应当按照本协议第一条约定的本金数总额以收到的乙方放款的币种为准偿还借款本金。
				<br> 2.2.2 甲方知晓并同意，因数字币自身特性及市场因素将导致同种数字币在本协议履行期限届满或者还款时（含提前还款）与协议签署时价值和价格产生差异，甲方同意抵押的数字币价值下跌至本协议第一条约定时的70%，需增加抵押物至总价值的90%以上。抵押的数字币价值持续下跌到本协议第一条约定的60%，甲方未增加抵押物，乙方会强制平仓。
				<br> 2.2.3 甲方同意以线上充值的方式将全部应还本金、利息、矿工费、钱包地址生成费及其他应付款项（如有）全额支付至甲方如下现金钱包，并在还款时依据平台系统提示履行信息填写、身份和密码验证等配合义务，否则由此造成的还款失败导致的逾期及其他不利后果由甲方自行承担。
				<br> 户名：
				<br> 地址：
				<br> 第三条  各方权利义务
				<br> 3.1甲方权利及义务
				<br> 3.1.1甲方确认已认真阅读和理解本协议所有内容并自愿按本协议相关约定享受权利和履行义务。
				<br> 3.1.2甲方签署本协议即视为接受本协议条款内容并受此内容之拘束。
				<br> 3.1.3甲方不得利用平台从事任何违法、违纪行为。
				<br> 3.1.4甲方有义务按照乙方提示提供真实、准确、完整的个人和联系人信息（包括但不限于电子邮件地址、手机号码等）；因甲方填写的个人信息有误造成的法律后果、经济损失均由甲方自行承担。
				<br> 3.1.5甲方同意并授权乙方通过其合作的第三方征信/数据渠道验证甲方信息真实性，甲方应自行承担其所提供信息被认定为虚假时的所有后果和法律责任。
				<br> 3.1.6 甲方应按本协议约定的还款时间和金额足额将当期/全部应还款项充值至甲方钱包进行还款，逾期将自愿按照本协议及其他相关约定承担违约责任。
				<br> 3.1.7甲方知晓并同意未按照约定的时间进行还款的，乙方有权进行平仓处理，抵押物所有权归乙方所有。
				<br> 3.1.8甲方确认，甲方自愿以个人持有的数字币为本协议项下贷款本金及其他相关费用的偿还提供质押担保。当甲方逾期时间、违约事由满足约定的乙方质押权实现条件时，乙方有权对甲方提供质押的数字币自行处置，乙方同意提供必要配合。
				<br> 3.1.9甲方委托乙方自行或者委托合作的第三方对乙方的放款数字币的币种的市场价值进行实时监测，并有权要求乙方将监测结果向甲方披露。
				<br> 3.1.10甲方认可并同意：若甲方逾期还款超过24的，乙方有权对甲方提供质押的数字币自行处置。
				<br> 3.1.11 甲方须按本合同约定的用途使用借款，并保证不利用本合同项下乙方所出借的款项从事违反所在国家法律法规的非法活动。
				<br> 3.1.12甲方不得将本协议项下贷款本金、利息及其他相关债务转移给任意第三人，否则视为甲方违约，应承担违约责任。
				<br> 3.2乙方权利及义务
				<br> 3.2.1乙方应按照本协议的约定，为甲方提供资金出借、提前还款协助及相关的信息咨询服务，并收取综合服务费。
				<br> 3.2.2乙方有权为了信用、资质审核的目的通过各类外部系统对甲方的个人信息、资产情况及其所提供的其他信息、资料进行验证，并对甲方个人信息负有保密义务。
				<br> 3.2.3乙方有权自行或委托合作的第三方机构通过甲方提供的个人信用信息及行为记录对甲方进行信用审核和风险评估，并有权依据审核、评估结果对是否向甲方出借资金以及出借资金的金额作出独立判断，甲方对此无异议。
				<br> 3.2.4乙方有权基于风险控制、市场变动、政策需要或系统维护等原因，将甲方所提供的合格抵押物托管至甲方实际控制的第三方钱包内，甲方保证不将该等抵押物用作本贷款协议项下以外之其他任何用途。
				<br> 3.2.5甲方授权并同意乙方在其自主运营的平台上公开甲方贷款的相关信息，甲方同意并认可乙方无需对于公布该信息所造成的后果承担任何责任。
				<br> 3.2.6乙方不得利用甲方个人相关信息为任何与本协议所载贷款事项无关的行为，亦不得为任何侵害甲方个人利益的行为。
				<br> 3.2.7乙方有权在约定的质押权实现事由出现/条件满足时对甲方提供质押的数字币自行处置。
				<br> 3.2.8乙方有义务确保乙方平台系统稳定运行，并在平台系统故障及排查、升级和停复机等无法正常运行事由出现时及时通知甲方。
				<br> 3.2.9在甲方提供符合乙方要求的各种类数字币进行质押时，冻结质押币。
				<br> 3.2.11接受甲方委托，自行或者委托合作的第三方对放款至甲方和甲方提供质押的数字币的币种的市场价值进行实时监测，并按照甲方的申请将监测结果向甲方披露。
				<br> 3.2.12 乙方有关为了信用、资质审核的目的，在甲方进行实际借款时，要求甲方新增或追加必要增信措施（包括：提供各类新的抵押资产等），来达到乙方所设定的服务标准或各类产品规则。
				<br> 若甲方所提供的抵押数字币由于市场波动所导致实际价值低于借款本金的规定比例（标准以乙方对外公布的产品服务规则为准），则乙方有权通知并立即要求甲方按指令增加同类质押物，用于补足对应余额。如甲方拒绝追加质押物，则经乙方3次有效催告后，乙方有权冻结甲方抵押物钱包并进行强制平仓，甲方对此无异议。
				<br> 3.2.13在甲方无法及时获取还款所需种类数字币时，按照甲方的申请或指令为甲方提供目标币种代购、置换服务。
				<br> 3.2.14在冻结甲方质押币后到甲方还清本协议项下所有贷款本金、综合服务费及其他相关费用之前的任何时间，自行或者应甲方要求在乙方向甲方提供各类币种的市场公允价格牌（至少包含甲方质押币种和放款币种），并在甲方申请提前结清、代购或置换标的币种以及代为还款时以此系统牌价为准提供上述相关服务。
				<br> 第四条  综合服务费、24小时赎回保险费、借款利息及其他费用的支付
				<br> 4.1综合服务费
				<br> 4.1.1对于为甲方提供资金出借、提前还款协助及相关的信息咨询服务，并收取综合服务费，甲方同意按照数字币向乙方支付综合服务费。
				<br> 4.2支付
				<br> 4.2.1甲方同意，乙方划入甲方的借款为扣除本协议第一条约定的，综合服务费、利息、24小时赎回保险费之后的金额。
				<br> 4.2.2甲方应当按照本协议第一条约定的本金数总额以收到的乙方放款的币种为准偿还借款本金后，视为甲方完成履行本协议约定的还款义务。
				<br> 第五条  提前结清
				<br> 5.1贷款期限届满前，甲方可根据需求自主决定是否提前结清。
				<br> 5.2甲方要求提前还款或结清的，需向乙方提出申请，并由乙方确定具体提前结清日期；甲方应在乙方确定的具体提前结清日期当日（非还款日或节假日）一次性将应还本金足额划入乙方钱包中。
				<br> 第六条  质押条款
				<br> 6.1质押权的设立及担保范围
				<br> 6.1.1 甲方应在借款申请提交后按照乙方的要求将本人持有的用以质押的数字币 充值入甲方在乙方平台开立的如下抵押物钱包（下称“抵押物钱包”）：
				<br> 户名：
				<br> 地址：
				<br> 6.1.2 甲方同意，在甲方充值完成后至本协议项下借款本金及其他相关费用清偿完毕前，乙方有权冻结该账户内所有甲方充值的质押数字币并有权对该抵押物钱包进行监管，甲方不得转移、提现或者以更改账户、密码或其他方式重新占有该质押数字币，亦不得以出售、赠与、抵押或其他任何方式损害或排除乙方对该质押数字币的相关权利。
				<br> 6.1.3 甲方同意，本条款项下由其所提供的数字币担保物质押范围包括：借款本金。
				<br> 6.2质押权实现的条件
				<br> 甲方同意，在甲方发生如下情形时，乙方可对甲方提供的数字币实现质押权：
				<br> 6.2.1甲方逾期未按期还款。
				<br> 6.2.2甲方因违反甲方所在国法律或者其他任何国家法律而受到人身监禁、财产冻结、禁止出入境或者其他严重处罚的。
				<br> 6.2.3甲方因任何违法行为导致承担刑事责任的。
				<br> 6.2.4甲方被国籍国、常居住地国、乙方注册地所在国法院列为失信未执行人。
				<br> 6.2.5甲方发生超出个人资产总量、与个人资产总量不符的重大资产支付、转移、处分等交易，或其他任何事由导致甲方个人、家庭资产总额大幅度减少等其他影响甲方偿还本协议项下债务能力的情形的。
				<br> 6.2.6甲方出资的企业因违反任何国家法律而导致被吊销营业执照、勒令关闭、被列为失信被执行人、资不抵债破产的。
				<br> 6.2.7甲方丧失民事行为能力，在乙方通知后的3日内未有监护人履行相关的监护职责的。
				<br> 6.2.8甲方死亡，在乙方知悉甲方死亡后的3日内未有继承人主张相关权利的。
				<br> 6.3质押权的实现
				<br> 6.3.1 本协议约定的质押权实现条件满足情况下，乙方有权在通知甲方后自行处置甲方的抵押物钱包内所有质押数字币。
				<br> 第七条   违约责任
				<br> 7.1甲方逾期偿还本协议项下的贷款本金的，按照本协议第六条第二款的约定实现质押权。
				<br> 7.2甲方提供虚假资料或者故意隐瞒重要事实即构成违约，应承担违约责任，乙方有权要求解除合同，甲方需在乙方要求解除合同后三日内一次性支付余下的款项，包括但不限于本金、利息、违约金及其他费用；如甲方存在涉嫌欺诈等犯罪行为的，乙方有权向国家司法机关报案，追究其刑事责任。
				<br> 7.3若甲方逾期还款或甲方出现逃避、拒绝沟通或拒绝承认欠款事实等违约失信行为，甲方同意并不可撤销地授权乙方或丙方可将甲方违约失信的相关信息向微博、微信、公众号、网络等媒体、用人单位、司法机关、国家或地方的个人信用征信系统进行披露等。由此造成的损失，由甲方自行承担，乙方不承担任何法律责任；因甲方未还款而带来的调查及诉讼费用包括律师代理费将由甲方承担。
				<br> 7.4甲方违反本协议约定擅自转让本协议贷款债务的，甲方应向乙方及丙方支付违约金。
				<br> 7.5甲方因违反本协议其他约定而给乙方造成损失的，应承担赔偿责任。
				<br> 7.6贷款人出现以下情形，均视为贷款人违约：
				<br> (1)甲方违反其在本协议及相关附件等所做的任何承诺或保证内容的；
				<br> (2)发生乙方认为严重影响到甲方履行能力的不利事件；
				<br> (3)甲方的财务状况出现实质性影响其履约能力的不利变化，且未及时对其他各方进行通知或不能及时采取有效补救措施的。
				<br> 7.7乙方合理判断甲方发生或可能发生违约时，可采取以下一项或几项救济措施：
				<br> (1)立即取消发放贷款；
				<br> (2)宣布已发放贷款全部提前到期，要求甲方立即偿还所有贷款本金并承担违约责任；
				<br> (3)解除、终止本协议；
				<br> (4)采取法律途径及本协议约定的其他救济措施。
				<br> 第八条   甲乙双方联系方式变更通知
				<br> 本协议签署之日起至本协议项下各方所有义务履行完毕之前，甲方本人、家庭住址、联系人及紧急联系人工作单位、居住地址、住所电话、手机号码、电子邮箱、账户信息如出现变更的，应在变更后三日内向丙方或向丙方指定的第三方提供变更后的信息。因甲方未及时提供更新信息或提供信息存在虚假而导致其自身和/或任何其他方遭受的损失（包括但不限于调查费用及诉讼费、律师代理费、差旅费用等）的，甲方应承担因此所导致的一切责任后果。
				<br> 第九条   陈述、保证和承诺
				<br> 9.1甲方承诺本协议项下贷款用途合法，甲方将所贷款项用于任何违法活动的，一经发现，乙方有权立即提前收回全部贷款，并有权立即向公安部门等司法机关举报、追究甲方的刑事责任。
				<br> 9.2甲方应配合并确保乙方或乙方指定第三方可以定期对甲方的履约情况及信用状况等内容进行检查与分析。
				<br> 9.3甲方对其提供质押的数字币具有完整、合法的所有权，且不存在其他权属纠纷，否则由此导致的纠纷由甲方负责解决，造成乙方损失的，甲方应承担赔偿责任。
				<br> 9.4甲方确认提供至乙方、在乙方平台填写的所有信息均为真实、有效的信息。
				<br> 9.5甲方均承诺不得利用乙方平台进行套现、洗钱或为其他违法违纪行为，否则应依法承担由此产生的法律责任与后果。
				<br> 9.6甲方委托乙方按照本协议约定实施的行为或采取的措施所产生的法律后果均由甲方自行承担，乙方无需承担任何责任。
				<br> 第十条  
				<br> 10.1如遇自然灾害等不可抗力事件，或其他不可预见的非常情况，如电力、网络、系统、通讯故障等原因，导致乙方或者乙方合作的第三方机构无法及时、正常履行义务的，乙方不承担任何责任。
				<br> 10.2因甲方的故意或疏忽导致交易密码泄露或遗失，由其自行承担相关损失，乙方不承担任何责任。
				<br> 10.3因甲方预留的放款账户已销户或账户状态不正常（包括但不限于挂失、冻结、变更）或者由于司法或其他原因而进行了账户冻结、扣划或被控制、销户，导致乙方无法履行本协议或给各方造成损失的，乙方不承担任何责任。
				<br> 10.4因法律和政策的重大变化或乙方不可预测和不可控因素导致的突发事件给其他各方造成损失的，乙方不承担任何责任。
				<br> 10.5因甲方任何违约行为导致自身遭受损失的，乙方不承担任何责任。
				<br> 第十一条   法律适用和管辖
				<br> 11.1本协议的签订、履行、终止、解释均适用乙方注册地所在国法律。
				<br> 11.2本协议各方确认，本协议的签署、生效和履行以不违反甲方国籍国、经常居住地国、乙方注册地所在国的法律法规为前提。如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。
				<br> 11.3本协议的履行地为乙方注册地。
				<br> 11.4如果本协议各方在本协议履行过程中发生任何争议，应友好协商解决；如协商不成，则须提交至乙方注册地法院诉讼解决。
				<br> 11.5在诉讼期间，本协议中不涉及争议的条款仍须履行，各方均不得以解决争议为由拒不履行其在本协议项下的任何义务。
			</p>
		</div>
		<div class="dialog-footer">
			<div class="submit-btn" @click="submit">同意协议</div>
		</div>
	</van-popup>
</template>
<script>
export default {
	props: {
		value: Boolean
	},
	data() {
		return {
			lockScroll: false
		};
	},
	methods: {
		closeBox() {
			this.$emit('input', false);
		},
		submit() {
			this.$emit('submit');
		}
	}
};
</script>
<style lang="scss" scoped>
@import './index.scss';
</style>